Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: Note that if the coordinator is running on a port different from the default, i.e. `50000`, then you will need to update the application config file (`src/main/resources/application.properties`) and specify the host and port:
ja_jp: なお、コーディネーターがデフォルトとは異なるポート（例： `50000` ）で動作している場合は、アプリケーションの設定ファイル（ `src/main/resources/application.properties` ）を更新し、ホストとポートを指定する必要があります。

source: Note that if we hover over the node we get information about the method itself.
ja_jp: なお、ノードの上にカーソルを置くと、メソッド自体の情報が表示されます。

source: Note that if you enable SSL for the mailer and you want to build a native executable, you will need to enable the SSL support. Please refer to the xref:native-and-ssl.adoc[Using SSL With Native Executables] guide for more information.
ja_jp: なお、メーラーのSSLを有効にしていて、ネイティブ実行可能ファイルをビルドする場合は、SSLのサポートを有効にする必要があります。詳しくは、 link:native-and-ssl.html[ネイティブイメージでのSSLの利用]をご参照ください。

source: Note that if you provide your custom JAXB context instance, you will need to register the classes you want to use for the XML serialization. This means that Quarkus will not update your custom JAXB context instance with the auto-discovered classes.
ja_jp: カスタム JAXB コンテキストインスタンスを提供する場合は、XML シリアル化に使用するクラスを登録する必要があることに注意してください。これは、Quarkus がカスタム JAXB コンテキストインスタンスを自動検出されたクラスで更新しないことを意味します。

source: Note that if you run it this way the continuous testing experience will not be as nice, as gradle runs as a daemon Quarkus can't draw the 'pretty' test output so falls back to just logging the output.
ja_jp: この方法で実行する場合、継続的テストの使い勝手は同じにはなりません。gradleはデーモンとして実行されるため、Quarkusは「きれいな」テスト出力を描くことができず、出力のログを取るだけになってしまうからです。

source: Note that in Docker/Kubernetes environments, this detection may result in internal IPs that are not externally reachable. In such cases, it's recommended to explicitly set the IP and port.
ja_jp: Docker や Kubernetes 環境では、この検出により外部から到達不可能な内部 IP が取得される可能性があることに注意してください。そのような場合は、IP とポートを明示的に設定することをお勧めします。

source: Note that in Reactive Messaging, the execution of processing methods, is already serialized, unless `@Blocking(ordered = false)` is used. If `withTransaction` can be called concurrently, for example from a REST endpoint, it is recommended to limit the concurrency of the execution. This can be done using the `@Bulkhead` annotation from link:https://quarkus.io/guides/smallrye-fault-tolerance[_Microprofile Fault Tolerance_].
ja_jp: Reactive Messaging では、 `@Blocking(ordered = false)` が使用されていない限り、処理メソッドの実行はすでにシリアライズされていることに注意してください。たとえば、REST エンドポイントから `withTransaction` を同時に呼び出すことができる場合は、実行の同時性を制限することをお勧めします。これは、 link:https://quarkus.io/guides/smallrye-fault-tolerance[_Microprofile Fault Tolerance_] の `@Bulkhead` アノテーションを使用して実行できます。

source: Note that in Reactive Messaging, the execution of processing methods, is already serialized, unless `@Blocking(ordered = false)` is used. If `withTransaction` can be called concurrently, for example from a REST endpoint, it is recommended to limit the concurrency of the execution. This can be done using the `@Bulkhead` annotation from xref:smallrye-fault-tolerance.adoc[_Microprofile Fault Tolerance_].
ja_jp: Reactive Messaging では、 `@Blocking(ordered = false)` が使用されていない限り、処理メソッドの実行はすでにシリアライズされていることに注意してください。 たとえば、REST エンドポイントから `withTransaction` を同時に呼び出すことができる場合は、実行の同時実行数を制限することが推奨されます。 これは、xref:smallrye-fault-tolerance.adoc[_Microprofile Fault Tolerance_] の `@Bulkhead` アノテーションを使用して実行できます。

source: Note that in addition to the standard CDI `@Inject` annotation, we also need to use the MicroProfile `@RestClient` annotation to inject `ExtensionsService`.
ja_jp: 標準の CDI `@Inject` アノテーションに加えて、MicroProfile `@RestClient` アノテーションを使用して `ExtensionsService` を注入する必要があることに注意してください。

source: Note that in addition to the standard CDI `@Inject` annotation, we also need to use the MicroProfile `@RestClient` annotation to inject `MultipartService`.
ja_jp: なお、標準のCDI `@Inject` アノテーションに加えて、マイクロプロファイル `@RestClient` アノテーションを使って `MultipartService` を入れる必要があることに注意してください。

source: Note that in case of `web-app` applications only `IdToken` is verified by default since the access token is not used by default to access the current Quarkus `web-app` endpoint and instead meant to be propagated to the services expecting this access token, for example, to the OpenID Connect Provider's UserInfo endpoint, etc. However if you expect the access token to contain the roles required to access the current Quarkus endpoint (`quarkus.oidc.roles.source=accesstoken`) then it will also be verified.
ja_jp: `web-app` アプリケーションでは、 `IdToken` だけがデフォルトで検証されており、なぜならアクセストークンはアクセス トークンは、現在の Quarkus の「web-app」エンドポイントにアクセスするためにデフォルトでは使用されず、代わりにこれを予期するサービスに伝播されることを意図しているためです。 たとえば、OpenID Connect プロバイダーの UserInfo エンドポイントなど。ただし、現在の Quarkus エンドポイント (`quarkus.oidc.roles.source=accesstoken`) にアクセスするために必要なロールがアクセス トークンに含まれることが期待される場合は、 これも検証されます。

source: Note that in case of `web-app` applications only `IdToken` is verified by default since the access token is not used by default to access the current Quarkus `web-app` endpoint and instead meant to be propagated to the services expecting this access token, for example, to the OpenID Connect Provider's UserInfo endpoint, etc. However, if you expect the access token to contain the roles required to access the current Quarkus endpoint (`quarkus.oidc.roles.source=accesstoken`) then it will also be verified.
ja_jp: `web-app` アプリケーションの場合、アクセストークンはデフォルトで現在の Quarkus `web-app` エンドポイントにアクセスするために使用されず、代わりにこれを期待するサービスに伝播されることを意図しているため、デフォルトでは `IdToken` のみが検証されることに注意してくださいたとえば、OpenID Connect Provider の UserInfo エンドポイントなどへのアクセストークン。ただし、アクセストークンに現在の Quarkus エンドポイント (`quarkus.oidc.roles.source=accesstoken`) にアクセスするために必要なロールが含まれていると予想される場合は、また、検証されます。

source: Note that in order to use `perf` to profile the native executables in the guide, the container needs to run as privileged, or with `--cap-add sys_admin`. Please note that privileged containers are **NOT** recommended in production, so use this flag with caution!
ja_jp: なお、 `perf` を使用してガイドのネイティブ実行可能ファイルをプロファイルするには、コンテナを特権的に実行するか、 `--cap-add sys_admin` を使用する必要があります。本番環境では特権コンテナは推奨され *ません* ので、このフラグの使用には注意が必要です。

source: Note that in this case Dev UI does not really enrich a dev experience since it is a Quarkus OIDC `web-app` application which controls the authorization code flow and acquires the tokens.
ja_jp: この場合、Dev UI は認可コードフローを制御してトークンを取得する Quarkus OIDC の `web-app` アプリケーションであるため、開発エクスペリエンスを充実させるものではないことに注意してください。

source: Note that in this case we have one incoming and one outgoing connector configuration, each one distinctly named. The configuration keys are structured as follows:
ja_jp: この場合、1 つの受信コネクター設定と 1 つの送信コネクター設定があり、それぞれに異なる名前が付けられていることに注意してください。設定キーは次のように構成されています。

source: Note that in this case we have one incoming and one outgoing connector configuration, each one distinctly named. The configuration properties are structured as follows:
ja_jp: この場合、着信側と発信側のコネクタ設定が1つずつあり、それぞれに明確な名前が付けられていることに注意してください。 設定プロパティは以下のような構造になっています：

source: Note that in this example, both the profile name and the document name match. They are, however, both freely definable.
ja_jp: この例では、プロファイル名とドキュメント名が一致していますが、これらは両方とも自由に定義可能です。

source: Note that in this first version of the Spring Cache annotations extension, not all features of these annotations are supported (with proper errors being logged when trying to use an unsupported feature). However, additional features are planned for future releases.
ja_jp: この最初のバージョンの Spring Cache アノテーションエクステンションでは、これらのアノテーションのすべての機能がサポートされているわけではないことに注意してください (サポートされていない機能を使用しようとすると、適切なエラーがログに記録されます)。しかし、今後のリリースでは追加機能が計画されています。

source: Note that internally an `org.bouncycastle.jce.provider.BouncyCastleProvider` provider will be registered if it has not already been registered.
ja_jp: なお、内部的には、 `org.bouncycastle.jce.provider.BouncyCastleProvider` プロバイダーがまだ登録されていない場合に登録されます。

source: Note that metrics appear lazily, you often won't see any data for your endpoint until something tries to access it, etc.
ja_jp: メトリクスは遅延的に表示され、何かがアクセスしようとするまでエンドポイントのデータが表示されないことが多いことに注意してください。

source: Note that only `@Valid` is supported on the return type. The returned class can use any constraint. In the case of `Uni`, it checks the item produced asynchronously.
ja_jp: リターンタイプでは `@Valid` のみがサポートされていることに注意してください。返されるクラスは任意の制約を使用できます。 `Uni` の場合、非同期で生成されたアイテムをチェックします。

source: Note that only executions within the same application instance are considered. This feature is not intended to work across the cluster.
ja_jp: 同じアプリケーションインスタンス内での実行のみが考慮されることに注意してください。この機能は、クラスター間での動作を意図したものではありません。

source: Note that outside of these methods, the `WebSocketClientConnection` object is not available. However, it is possible to <<list-open-client-connections,list all open client connections>>.
ja_jp: これらのメソッド以外では、 `WebSocketClientConnection` オブジェクトは利用できないことに注意してください。ただし、<<list-open-client-connections,開いているすべてのクライアント接続をリスト表示>> することは可能です。

source: Note that outside of these methods, the `WebSocketConnection` object is not available. However, it is possible to <<list-open-connections,list all open connections>>.
ja_jp: これらのメソッド以外では、 `WebSocketConnection` オブジェクトは利用できないことに注意してください。ただし、<<list-open-connections,開いているすべての接続をリスト表示>> できます.。

source: Note that reactive messaging verifies that the graph is complete. So, when using such a conditional configuration, ensure the application works with and without the profile enabled.
ja_jp: リアクティブメッセージングでは、グラフが完全であることを確認することに注意してください。 したがって、このような条件付き設定を使用する場合は、プロファイルの有効化の有無に関係なく、アプリケーションが動作することを確認してください。

source: Note that replication in Redis is asynchronous, so replica nodes may be lagging behind the master node.
ja_jp: Redis のレプリケーションは非同期であるため、レプリカノードはマスターノードより遅れる可能性があることに注意してください。

source: Note that replication in Redis is asynchronous, so replica nodes may be lagging behind their master nodes.
ja_jp: Redis のレプリケーションは非同期であるため、レプリカノードはマスターノードより遅れる可能性があることに注意してください。

source: Note that requiring <<user-info,UserInfo>> involves making a remote call on every request - therefore you may want to consider caching `UserInfo` data, see <<token-introspection-userinfo-cache,Token Introspection and UserInfo Cache> for more details.
ja_jp: <<user-info,ユーザー情報>> を要求すると、リクエストのたびにリモートコールを行うことになるので、 `UserInfo` データのキャッシュを検討するとよいでしょう。詳しくは <<token-introspection-userinfo-cache,トークンイントロスペクションと UserInfo キャッシ

source: Note that sections can override names that would otherwise match a parameter declaration:
ja_jp: セクションは、パラメーター宣言にマッチする名前をオーバーライドできることに注意してください。

source: Note that some OpenID Connect providers do not support https://openid.net/specs/openid-connect-session-1_0.html#RPLogout[RP-Initiated Logout] specification (possibly because it is still technically a draft) and do not return an OpenID Connect well-known `end_session_endpoint` metadata property. However it should not be a problem since these providers' specific logout mechanisms may only differ in how the logout URL query parameters are named.
ja_jp: OpenID Connectプロバイダによっては、 link:https://openid.net/specs/openid-connect-session-1_0.html#RPLogout[RP-Initiated Logout] 仕様をサポートしておらず（おそらく技術的にまだドラフトであるため）、OpenID Connect well-known `end_session_endpoint` メタデータプロパティを返さない場合があることに注意してください。しかし、これらのプロバイダーの特定のログアウトメカニズムは、ログアウトURLクエリパラメータの名前の付け方が異なるだけかもしれないので、問題になることはないでしょう。

source: Note that some OpenID Connect providers do not support https://openid.net/specs/openid-connect-session-1_0.html#RPLogout[RP-Initiated Logout] specification (possibly because it is still technically a draft) and do not return an OpenID Connect well-known `end_session_endpoint` metadata property. However, it should not be a problem since these providers' specific logout mechanisms may only differ in how the logout URL query parameters are named.
ja_jp: OpenID Connect プロバイダーの中には、 https://openid.net/specs/openid-connect-session-1_0.html#RPLogout[RP-Initiated Logout] 仕様をサポートしておらず (おそらく技術的にまだドラフトであるため)、OpenID Connect がよく知る `end_session_endpoint` メタデータプロパティーを返さないものがあることに注意してください。しかし、これらのプロバイダー特有のログアウトメカニズムは、ログアウト URL クエリーパラメーターの命名方法が異なるだけなので、問題にはなりません。

source: Note that some Quarkus extensions are wrapping Vert.x clients and manage them for you. That's the case for the reactive data sources, Redis, mail... That's not the case with the Web Client.
ja_jp: Quarkusのエクステンションの中には、Vert.xクライアントをラッピングして管理してくれるものがあります。 これは、リアクティブデータソース、Redis、メールなどの場合です。 Web Clientは対象ではありません。

source: Note that some configuration attributes are specific to HTTP/2. For example, to configure the max header list size (~ header), you need to configure the `quarkus.http.limits.max-header-list-size` attribute. You can also enable or disable HTTP/2 push using `quarkus.http.http2-push-enabled`.
ja_jp: いくつかの設定属性はHTTP/2に固有であることに注意してください。例えば、最大ヘッダーリストサイズ (~ヘッダー) を設定するには、 `quarkus.http.limits.max-header-list-size` 属性を設定する必要があります。また、 `quarkus.http.http2-push-enabled` を使用して、HTTP/2プッシュを有効または無効にすることもできます。

source: Note that some endpoints do not require the access token. An access token is only required if the endpoint needs to retrieve `UserInfo` or access the downstream service with this access token or use the roles associated with the access token (the roles in the ID token are checked by default). In such cases you can set either `quarkus.oidc.token-state-manager.strategy=id-refresh-token` (keep ID and refresh tokens only) or `quarkus.oidc.token-state-manager.strategy=id-token` (keep ID token only).
ja_jp: エンドポイントによっては、アクセストークンを必要としないものもあることに注意しましょう。アクセストークンが必要なのは、エンドポイントが `UserInfo` を取得したり、このアクセストークンを使って下流のサービスにアクセスしたり、アクセストークンに関連付けられたロール (デフォルトでは ID トークンのロールがチェックされます) を使用する必要がある場合のみです。このような場合は、 `quarkus.oidc.token-state-manager.strategy=id-refresh-token` (ID およびリフレッシュトークンのみを保持) または `quarkus.oidc.token-state-manager.strategy=id-token` (ID トークンだけを保持) を設定できます。

source: Note that tenant specific configurations can also be disabled, for example: `quarkus.oidc.tenant-a.tenant-enabled=false`.
ja_jp: テナント固有の設定を無効にすることもできます。例: `quarkus.oidc.tenant-a.tenant-enabled=false`

source: Note that the CSRF filter has to read and cache the input stream in order to verify the token. However if you prefer you can compare the CSRF form field and cookie values in the application code:
ja_jp: CSRFフィルタはトークンを検証するために入力ストリームを読み込んでキャッシュする必要があることに注意してください。しかし、希望におうじて、アプリケーション・コードでCSRFフォーム・フィールドとクッキーの値を比較することもできます:

source: Note that the Elasticsearch hosts property is automatically configured with the chosen port.
ja_jp: Elasticsearchのhostsプロパティは、選択したポートで自動的に構成されることに注意してください。

source: Note that the Kafka advertised address is automatically configured with the chosen port.
ja_jp: Kafkaのアドバタイズされたアドレスは、選択したポートで自動的に設定されることに注意してください。

source: Note that the Kafka channels in SmallRye Reactive messaging are automatically configured with the chosen port.
ja_jp: SmallRye Reactive messaging のKafkaチャンネルは、選択したポートで自動的に設定されることに注意してください。

source: Note that the OpenID Connect Provider externally accessible authorization, logout and other endpoints may have different HTTP(S) URLs compared to the URLs auto-discovered or configured relative to `quarkus.oidc.auth-server-url` internal URL. In such cases an issuer verification failure may be reported by the endpoint and redirects to the externally accessible Connect Provider endpoints may fail.
ja_jp: OpenID Connect Provider の外部アクセス可能な認証、ログアウト、その他のエンドポイントは、自動検出された URL や内部 URL `quarkus.oidc.auth-server-url` に対して設定された URL とは異なる HTTP(S) URL を持つ場合があることに注意してください。このような場合、エンドポイントから発行者確認の失敗が報告され、外部からアクセス可能な接続プロバイダーのエンドポイントへのリダイレクトに失敗する可能性があります。

source: Note that the OpenID Connect Provider externally accessible token and other endpoints may have different HTTP(S) URLs compared to the URLs auto-discovered or configured relative to `quarkus.oidc.auth-server-url` internal URL. For example, if your SPA acquires a token from an external token endpoint address and sends it to Quarkus as a Bearer token then an issuer verification failure may be reported by the endpoint.
ja_jp: OpenID Connect プロバイダーの外部からアクセス可能なトークンおよび他のエンドポイントは、自動検出または設定された URL とは異なる HTTP(S) URL (`quarkus.oidc.auth-server-url` 内部 URL からの相対 URL) を持つことに注意してください。たとえば、SPA が外部トークンエンドポイントアドレスからトークンを取得し、それをベアラートークンとして Quarkus に送信すると、発行者の検証の失敗がエンドポイントによって報告される場合があります。

source: Note that the Pulsar advertised address is automatically configured with the chosen port.
ja_jp: Pulsar がアドバタイズするアドレスは、選択したポートで自動的に設定されることに注意してください。

source: Note that the Pulsar consumer property `subscriptionInitialPosition` is also configured with the `Earliest` value which represents with enum value `SubscriptionInitialPosition.Earliest`.
ja_jp: Pulsar コンシューマーのプロパティー `subscriptionInitialPosition` も、列挙値 `SubscriptionInitialPosition.Earliest` として表される `Earliest` 値で設定されていることに注意してください。

source: Note that the STM implementation provided by Quarkus is based on the https://narayana.io/docs/project/index.html#d0e16066[Narayana STM] implementation. This document isn't meant to be a replacement for that project's documentation, so you may want to look at it for more detail. However, we will try to focus more on how you can combine some key capabilities into Quarkus when developing Kubernetes native applications and microservices.
ja_jp: Quarkus が提供する STM の実装は、 link:https://narayana.io/docs/project/index.html#d0e16066[Narayana STM] の実装に基づいています。このドキュメントは、そのプロジェクトのドキュメントに代わるものではありません。そのため、その詳細についてはそちらを参照してください。しかし、Kubernetes ネイティブアプリケーションやマイクロサービスを開発する際に、主要な機能のいくつかを Quarkus にどのように組み合わせることができるかについて、より焦点を当ててみたいと思います。

source: Note that the `@TestSecurity` annotation must always be used, and its `user` property is returned as `JsonWebToken.getName()` and `roles` property - as `JsonWebToken.getGroups()`. `@JwtSecurity` annotation is optional and can be used to set the additional token claims.
ja_jp: `@TestSecurity` アノテーションは常に使用する必要があり、その `user` プロパティーは `JsonWebToken.getName()` として返され、 `roles` プロパティーは `JsonWebToken.getGroups()` として返されることに注意してください。 `@JwtSecurity` アノテーションはオプションであり、追加のトークン要求を設定するために使用できます。

source: Note that the `_total` suffix is added when Micrometer applies Prometheus naming conventions to `example.prime.number`, the originally specified counter name.
ja_jp: Micrometer が最初に指定されたカウンター名である `example.prime.number` に Prometheus 命名規則を適用すると、サフィックス `_total` が追加されることに注意してください。

source: Note that the `acks` attribute has a huge impact on the record acknowledgement.
ja_jp: `acks` 属性は、レコードの確認応答に大きく影響することに注意してください。

source: Note that the `compose-devservices.yml` file can be customized as needed with multiple services with dependencies to control the startup order, custom networks to isolate service communication, and volumes for data persistence and configuration.
ja_jp: 必要に応じて `compose-devservices.yml` ファイルをカスタマイズして、起動順序を制御する依存関係を持つ複数のサービス、サービス通信を分離するカスタムネットワーク、およびデータ永続化と構成のためのボリュームを使用できることに注意してください。

source: Note that the `generate` method returns a `Multi<Double>`, which implements the Reactive Streams `Publisher` interface. This publisher will be used by the framework to generate messages and send them to the configured Kafka topic.
ja_jp: `generate` メソッドは `Multi<Double>` を返すことに注意してください。これは、Reactive Streams `Publisher` インターフェイスを実装します。 このパブリッシャーは、メッセージを生成し、設定された Kafka トピックに送信するためにフレームワークによって使用されます。

source: Note that the `pulsar.client.authParams` configuration contains a Json string with `issuerUrl`, `audience` and the `privateKey` in the `data:application/json;base64,<base64-encoded-key-file>` format.
ja_jp: `pulsar.client.authParams` 設定には、 `issuerUrl`、 `audience`、および `data:application/json;base64,<base64-encoded-key-file>` という形式の `privateKey` を含む Json 文字列が含まれていることに注意してください。

source: Note that the `quarkus-test-oidc-server` extension includes a signing RSA private key file in a `JSON Web Key` (`JWK`) format and points to it with a `smallrye.jwt.sign.key.location` configuration property. It allows to use a no argument `sign()` operation to sign the token.
ja_jp: `quarkus-test-oidc-server` エクステンションには、 `JSON Web Key` (`JWK`) 形式の署名 RSA 秘密鍵ファイルが含まれており、 `smallrye.jwt.sign.key.location` 設定プロパティーでそれをポイントすることに注意してください。引数なしの `sign ()` 操作を使用してトークンに署名できます。

source: Note that the `quarkus.http.root-path` is hiding in this example, because its value is `/`.
ja_jp: この例では `quarkus.http.root-path` が隠れていることに注意してください。値が `/` だからです。

source: Note that the `with` section should not be used in <<typesafe_templates>> or templates that define <<typesafe_expressions>>. The reason is that it prevents Qute from validating the nested expressions. If possible it should be replaced with the `{#let}` section which declares an explicit binding:
ja_jp: <<typesafe_templates>> や <<typesafe_expressions>> を定義するテンプレートでは、 `with` セクションを使用してはならないことに注意してください。理由は、Qute がネストされた式を検証できなくなるからです。可能であれば、明示的なバインディングを宣言する `{#let}` セクションに置き換える必要があります。

source: Note that the `with` section should not be used in <<typesafe_templates>> or templates that define <<typesafe_expressions>>. The reason is that it prevents Qute from validating the nested expressions. If possible, replace it with the `{#let}` section which declares an explicit binding:
ja_jp: <<typesafe_templates>> や、<<typesafe_expressions>> を定義するテンプレートでは、`with` セクションを使用してはならないことに注意してください。 これは、Qute がネストされた式を検証することを妨げるためです。 可能であれば、明示的なバインディングを宣言する `{#let}` セクションに置き換えてください。

source: Note that the `with` section should not be used in xref:typesafe_templates[Type-safe Templates] or templates that define xref:typesafe_expressions[Type-safe Expressions]. The reason is that it prevents Qute from validating the nested expressions. If possible, replace it with the `{#let}` section which declares an explicit binding:
ja_jp: なお、 `with` セクションは、 xref:typesafe_templates[タイプセーフテンプレート] や xref:typesafe_expressions[タイプセーフ式] を定義するテンプレートでは使用しないでください。理由は、Quteがネストした式を検証するのを妨げるからです。可能であれば、明示的なバインディングを宣言する `{#let}` セクションに置き換えてください:

source: Note that the class does not declare a logger field. This is because during application build, a `private static final org.jboss.logging.Logger` field is created automatically in each class that uses the `Log` API. The fully qualified name of the class that calls the `Log` methods is used as a logger name. In this example, the logger name would be `com.example.MyService`.
ja_jp: このクラスはロガー・フィールドを宣言していないことに注意してください。 これは、アプリケーションのビルド中に、 `Log` API を使用する各クラスに `private static final org.jboss.logging.Logger` フィールドが自動的に作成されるためです。 `Log` メソッドを呼び出すクラスの完全修飾名が、ロガー名として使用されます。この例では、ロガー名は `com.example.MyService` です。

source: Note that the class doesn't declare a logger field. This is because during application build, a `private static final org.jboss.logging.Logger` field is created automatically, in each class that uses the `Log` API. The fully qualified name of the class that calls the `Log` methods is used as a logger name. In this example, the logger name would be `com.example.MyService`.
ja_jp: なお、このクラスではloggerフィールドを宣言していません。これは、アプリケーションのビルド時に、 `Log` API を使用する各クラスに `private static final org.jboss.logging.Logger` フィールドが自動的に作成されるためです。 `Log` メソッドを呼び出したクラスの完全修飾名がロガー名として使用されます。この例では、ロガー名は `com.example.MyService` となります。

source: Note that the configuration properties are shared with the `kubernetes-client` extension. In particular they have the same `quarkus.kubernetes-client` prefix.
ja_jp: 設定プロパティーは `kubernetes-client` エクステンションと共有されていることに注意してください。特に、これらは同じ `quarkus.kubernetes-client` プレフィックスを持っています。

source: Note that the configuration properties are shared with the `kubernetes-client` extension. In particular, they have the same `quarkus.kubernetes-client` prefix.
ja_jp: 設定プロパティーは `kubernetes-client` エクステンションと共有されていることに注意してください。特に、これらは同じ `quarkus.kubernetes-client` プレフィックスを持っています。

source: Note that the default startup timeout is 60s, if this is not enough you can increase it with the `quarkus.devservices.timeout` property.
ja_jp: なお、デフォルトの起動タイムアウトは60秒ですが、これでは不十分な場合は、 `quarkus.devservices.timeout` プロパティで増やすことができます。
